# CustomAxis Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCExtrusionCreationData..::..CustomAxis Property
IFCExtrusionCreationData Class See Also
---
The custom extrusion axis to try when generating an extrusion.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public XYZ CustomAxis { get; set; }
```

Visual Basic
---
```text
Public Property CustomAxis As XYZ
	Get
	Set
```

Visual C++
---
```text
public:
property XYZ^ CustomAxis {
	XYZ^ get ();
	void set (XYZ^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
IFCExtrusionCreationData Class
Autodesk.Revit.DB.IFC Namespace